
Процедура Запуститься()

	РазделительПути = ПолучитьРазделительПути();

	ЛогДляРазбора = ПолучитьПеременнуюСреды("proxyResult");
	КаталогИсходников = ПолучитьПеременнуюСреды("srcPatch") ;
	КаталогРезультата = ПолучитьПеременнуюСреды("genericResultDir");
	ПутиКИсходникам = ПолучитьПеременнуюСреды("srcPatch");

	ВременнаяКопия = ПолучитьИмяВременногоФайла("log");
	КопироватьФайл(ЛогДляРазбора, ВременнаяКопия);

	ЧтениеТекста = New ЧтениеТекста(ВременнаяКопия);

	//Конвертор = Новый Конвертор;
	//Конвертор.УстановитьФайлКонфигурации(КаталогИсходников);

	Строка = ЧтениеТекста.ПрочитатьСтроку();

	Пока НЕ Строка = Неопределено Цикл 
	
//		Конвертор.ПодготовитьЛог(Строка);
	
		Строка = ЧтениеТекста.ПрочитатьСтроку();
	
	КонецЦикла;	

//	Конвертор.СохранитьРезультат(КаталогРезультата);

	// УдалитьФайлы(ВременнаяКопия);

КонецПроцедуры	


Функция ПолучитьПеременнуюСреды(Имя)
	
	Возврат Имя;
КонецФункции	                                                   